<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" 
   "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="de" lang="de">

<head>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1" />
<title>Funktionen</title>
<link type="text/css" rel="stylesheet" href="book.css" />
</head>

<body>

<div id="all">

    <div id="close">
        <p id="close_img_de">
            <a href="http://org.eclipse.ui.intro/close"><img src="images/close_de.png" width="262" height="25" alt="Schlie&#223;en"/></a>
        </p>
    </div>

	<div id="top">
        <p>
            <a href="http://org.eclipse.ui.intro/showPage?id=root"><img src="../logos/logo_64.png" width="64" height="64" alt="Willkommen"/></a>
        </p>
	</div>

	<div id="header">
		<h1>Funktionen</h1>
	</div>

	<div id="main">

		<h3>Unterst&#252;tzung s&#228;mtlicher Saiteninstrumente</h3>
		<ul class="features">
			<li>Der <em>Chord Scale Generator</em> unterst&#252;tzt s&#228;mtliche Saiteninstrumente mit 2 bis 12 Einzel- oder Doppelsaiten. Dies umfasst Instrumente wie Gitarre, Bass, Ukulele, Banjo, Mandoline, Violine, Viola, Cello, Contrabass, Balalaika, Bouzouki, Cavaquinho, Charango, Domra und viele mehr.</li>
			<li>Es werden beim <em>Chord Scale Generator</em> viele Instrumente mit den gebr&#228;uchlichsten Stimmungen schon mitgeliefert.</li>
			<li>Du kannst aber auch neue Instrumente hinzuf&#252;gen. Dabei kannst du neben den Dimensionen (Saiten- und Bundanzahl) und der Stimmung auch fortgeschrittenere Einstellungen definieren, wie den Klang, die Mensur oder beliebige Kapodaster-Positionen.</li>
		</ul>
		
		<h3>Unterst&#252;tzung s&#228;mtlicher Akkorde</h3>
		<ul class="features">
			<li>Der <em>Chord Scale Generator</em> unterst&#252;tzt s&#228;mtliche m&#246;glichen Akkorde.</li>
			<li>Dabei werden eine Gro&#223;zahl der &#252;blichen Akkorde mitgeliefert, wie z.B. Dur, moll, maj7, aug, dim, m7, add9, add11 und viele mehr.</li>
			<li>Nat&#252;rlich kannst du auch hier neue Akkorde hinzuf&#252;gen.</li>
			<li>Es werden zudem verschiedene Bezeichnungen f&#252;r einen Akkord unterst&#252;tzt.</li>
		</ul>
		
		<h3>Unterst&#252;tzung s&#228;mtlicher Skalen</h3>
		<ul class="features">
			<li>Der <em>Chord Scale Generator</em> unterst&#252;tzt neben Akkorden auch s&#228;mtliche Skalen.</li>
			<li>Hier sind auch schon die gebr&#228;uchlichsten Skalen mit den Kirchentonarten und einigen Pentatoniken enthalten.</li>
			<li>Du kannst aber nat&#252;rlich auch hier noch neue Skalen definieren und der Skalenliste hinzuf&#252;gen.</li>
		</ul>
		
		<h3>Bestimmung aller Griffm&#246;glichkeiten eines Akkords</h3>
		<ul class="features">
			<li>Der <em>Chord Scale Generator</em> hilft dir dabei, alle Griffm&#246;glichkeiten f&#252;r einen Akkord zu bestimmen.</li>
			<li>Dabei werden die Griffm&#246;glichkeiten jedesmal mit Hilfe eines leistungsstarken Algorithmus generiert. Es wird also nicht auf eine starre Datenbasis zur&#252;ckgegriffen.</li>
			<li>Die Ergebnismenge l&#228;sst sich dabei mit vielen Einstellm&#246;glichkeiten beschr&#228;nken. M&#246;gliche Einstellm&#246;glichkeiten sind dabei unter anderem der Schwierigkeitsgrad, der Bass- und Melodieton sowie Bundbereiche und Griffbreiten.</li>
		</ul>
		
		<h3>Bestimmung von Akkorden zu einem Griff- bzw. Notenbild</h3>
		<ul class="features">
			<li>Der <em>Chord Scale Generator</em> erm&#246;glicht auch in einer umgekehrten Berechung zu einem gegebenen Griff- oder Notenbild, die entsprechenden Akkorde zu bestimmen.</li>
		</ul>
		
		<h3>Bestimmung von passenden Skalen zu einer Melodie oder einem Lauf</h3>
		<ul class="features">
			<li>Der <em>Chord Scale Generator</em> hilft dir auch zu einer Melodie oder einem improvisierten Lauf, passende Skalen zu ermitteln.</li>
			<li>Es werden hier alle Skalen gefunden, welche mindestens die T&#246;ne deiner Melodie abdecken. Somit werden dir Skalen bereitgestellt, mit welchen du deine Melodie problemlos erweitern kannst.</li>
		</ul>
		
		<h3>Anzeige von Akkorden und Skalen in verschiedenen grafischen Sichten</h3>
		<ul class="features">
			<li>Der <em>Chord Scale Generator</em> stellt die in den Berechnungen ermittelten Akkorde und Skalen in verschiedenen grafischen Sichten dar.</li>
			<li>Du kannst dir dabei Akkorde und Skalen auf einem stilisiertem Griffbrett, einer Klaviatur, als Tabulatur oder Box sowie in Notenschreibweise anzeigen lassen.</li>
		</ul>
		
		<h3>Sound-Unterst&#252;tzung</h3>
		<ul class="features">
			<li>Es ist neben der grafischen Darstellung auch m&#246;glich, sich Akkorde und Skalen anspielen zu lassen, um herauszufinden, wie diese klingen.</li>
			<li>Dabei werden die aktuell angespielten T&#246;ne auch grafisch hervorgehoben.</li>
			<li>Wie die Akkorde und Skalen angespielt werden sollen, kannst du selbst festlegen.</li>
		</ul>
		
		<h3>Exportieren von Akkorden und Skalen</h3>
		<ul class="features">
			<li>Es ist m&#246;glich, s&#228;mtliche grafischen Darstellungen von Akkorden und Skalen zu exportieren.</li>
			<li>Du kannst dir somit auf einfache Weise deine eigenen Akkord-, Skalen- und Liederb&#252;cher zusammenstellen.</li>
		</ul>
		
		<h3>Unterschiedliche Darstellung f&#252;r Links- und Rechtsh&#228;nder</h3>
		<ul class="features">
			<li>Der <em>Chord Scale Generator</em> ber&#252;cksichtigt Links- und Rechtsh&#228;nder und somit auch das Spielen von Lefty- und Righty-Instrumenten.</li>
			<li>Abh&#228;ngig von der Einstellung der "Handart" werden diverse grafische Sichten angepasst.</li>
		</ul>
		
		<h3>Frei gestaltbare Benutzeroberfl&#228;che</h3>
		<ul class="features">
			<li>Der <em>Chord Scale Generator</em> verf&#252;gt &#252;ber eine Benutzeroberfl&#228;che, welche sich aus einer Vielzahl einzelner Sichten und Editoren zusammensetzt.</li>
			<li>Die Sichten und Editoren lassen sich dabei frei zu Perspektiven arrangieren. Hierbei ist es m&#246;glich, dass du f&#252;r jede Aufgabe eine eigene Perspektive definierst.</li>
			<li>Zudem lassen sich viele Sichten noch auf deine Pr&#228;ferenzen anpassen.</li>
			<li>Du kannst also komplett selbst bestimmen, wie sich der <em>Chord Scale Generator</em> f&#252;r die einzelnen Aufgaben pr&#228;sentieren soll.</li>
		</ul>
		
		<h3>Update-Funktionalit&#228;t</h3>
		<ul class="features">
			<li>Beim <em>Chord Scale Generator</em> steht eine Update-Funktion zur Verf&#252;gung, womit du das Programm sofort auf den neuesten Stand bringen kannst.</li>
		</ul>
		
		<h3>Ausf&#252;hrliche Hilfe verf&#252;gbar</h3>
		<ul class="features">
			<li>Beim <em>Chord Scale Generator</em> gibt es eine kontext-sensitive Hilfe, welche dir zu jedem Programmelement ausf&#252;hrliche Informationen zur Verf&#252;gung stellt.</li>
		</ul>

    	<div class="link">
    		<p><a href="http://org.eclipse.ui.intro/showPage?id=root">Zur&#252;ck zur Hauptseite</a></p>
    	</div>

	</div>

</div>

</body>
</html>
