<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" 
   "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="de" lang="de">

<head>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1" />
<title>Versionen</title>
<link type="text/css" rel="stylesheet" href="book.css" />
</head>

<body>

<div id="all">

    <div id="close">
        <p id="close_img_de">
            <a href="http://org.eclipse.ui.intro/close"><img src="images/close_de.png" width="262" height="25" alt="Schlie&#223;en"/></a>
        </p>
    </div>

	<div id="top">
        <p>
            <a href="http://org.eclipse.ui.intro/showPage?id=root"><img src="../logos/logo_64.png" width="64" height="64" alt="Willkommen"/></a>
        </p>
	</div>

	<div id="header">
		<h1>Versionen</h1>
	</div>

	<div id="main">

		<p>
		Den <em>Chord Scale Generator</em> kannst du solange du m&#246;chtest als Test-Version auf deinem 
		Rechner installiert haben. Somit kannst du den <em>Chord Scale Generator</em> ausf&#252;hrlich 
		testen, bevor du dir gegebenenfalls die Vollversion zulegst.
		</p>

		<p>
		Bei der Test-Version steht dir dabei nahezu der gesamte Funktionsumfang zur Verf&#252;gung. Du 
		kannst s&#228;mtliche Berechnungen auf beliebigen Instrumenten durchf&#252;hren sowie die Ergebnisse 
		exportieren, um Akkord-, Skalen- oder Liederb&#252;cher zu erstellen.
		</p>

		<p>
		Der Umfang der bereit gestellten Akkorde und Skalen ist in der Test-Version jedoch logischerweise 
		begrenzt. Es werden nur bestimmte Akkorde und Skalen mitgeliefert und es ist nicht m&#246;glich, diese 
		zu ver&#228;ndern oder neue Akkorde oder Skalen zu erzeugen. Du kannst also die Berechnungen nur f&#252;r 
		eine bestimmte Anzahl von Akkorden und Skalen ausf&#252;hren.
		</p>

		<p>
		<span class="note">Beachte:</span> Mit der Einschr&#228;nkung auf eine begrenzte Anzahl von Akkorden und Skalen kann es speziell 
		bei den Berechnungen zum Finden von Akkorden oder Skalen zu Griff- oder Notenbildern manchmal 
		zu unbefriedigenden Ergebnissen kommen. Dies h&#228;ngt damit zusammen, dass nur Akkorde und Skalen 
		gefunden werden k&#246;nnen, welche auch in dem Programm definiert sind.
		</p>

		<p>
		Wir hoffen aber trotz dieser Einschr&#228;nkung, dass du den <em>Chord Scale Generator</em> ausf&#252;hrlich 
		testen kannst und du einen ersten Einblick &#252;ber den Funktionsumfang des Programms erh&#228;ltst. 
		Solltest du dich f&#252;r den Kauf dieser Software entscheiden, ben&#246;tigst du einen Aktivierungsschl&#252;ssel. 
		Diesen kannst du auf unserer <a href="http://www.pluck-n-play.com/de/kauf.html" target="_blank">Website</a> 
		k&#228;uflich erwerben.
		</p>

		<p>
		<span class="note">Achtung:</span> Um den <em>Chord Scale Generator</em> freizuschalten, ben&#246;tigt der Rechner auf welchem 
		du den <em>Chord Scale Generator</em> benutzen m&#246;chtest, kurzzeitig Internet-Zugang.
		</p>

    	<div class="link">
    		<p><a href="http://org.eclipse.ui.intro/showPage?id=root">Zur&#252;ck zur Hauptseite</a></p>
    	</div>

	</div>
	
</div>

</body>
</html>
