<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
   "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="de" lang="de">

<head>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1" />
<title>Export-Funktionen</title>
<link type="text/css" rel="stylesheet" href="../book.css" />
</head>

<body>

<h1>Export-Funktionen</h1>
<p>
In diesem Kapitel soll nun noch auf die Export-M&#246;glichkeiten vom <em>Chord Scale Generator</em>
eingegangen werden. Beim <em>Chord Scale Generator</em> kannst du den Inhalt s&#228;mtlicher grafischen Sichten
(also der Sichten  <a href="../workbench/views/box.html">Box</a>, <a href="../workbench/views/tab.html">Tab</a>,
<a href="../workbench/views/notes.html">Noten</a>, <a href="../workbench/views/fretboard.html">Griffbrett</a> und
<a href="../workbench/views/keyboard.html">Klaviatur</a>) als Bilddatei exportieren oder in die Zwischenablage kopieren.
Um den aktuellen Inhalt zu exportieren oder in die Zwischenablage zu kopieren,
musst du dabei lediglich den entsprechenden Kontextmen&#252;eintrag der jeweiligen Sicht ausw&#228;hlen.
</p>

<p>
    <enablement><not><systemTest property="osgi.os" value="macosx"/></not></enablement>
	<img src="../../images/tasks/export_01.png" width="361" height="288" alt="Export"/>
</p>
<p>
    <enablement><systemTest property="osgi.os" value="macosx"/></enablement>
	<img src="../../images/tasks/macosx/export_01.png" width="361" height="288" alt="Export"/>
</p>

<p>
Mit dem Einf&#252;gen von Inhalten aus der Zwischenablage oder dem Einbinden von exportierten Bilddateien,
kannst du dir dann in anderen Programmen (z.B. Office-Programmen, ...)
auf einfache Weise deine eigenen Akkord- oder Liederb&#252;cher zusammenstellen.
Da das Zusammenstellen von Akkordb&#252;chern mit dem einzelnen Kopieren interessanter Akkorde sich wohl doch als etwas m&#252;hsam gestalten w&#252;rde,
gibt es noch ein besonderes Feature beim <em>Chord Scale Generator</em>.
Ausgehend von der  <a href="../workbench/views/chord_results.html">Akkord-Ergebnisse-Sicht</a> ist es m&#246;glich,
gleich mehrere Akkorde gleichzeitig in die Zwischenablage zu kopieren. Bei Akkorden, welche du so kopieren m&#246;chtest,
musst du zun&#228;chst den Haken in der vordersten Spalte setzen. Du kennzeichnest auf diesem Wege also die f&#252;r dich interessanten Akkorde.
Mit dem Kontextmen&#252;eintrag <em>Kopiere in die Zwischenablage</em>
werden dann anschlie&#223;end die Bilddaten dieser ausgew&#228;hlten Akkorde in die Zwischenablage kopiert.
In einem anderen Programm kannst du dann diese in der Zwischenablage befindlichen Bilddaten einfach einf&#252;gen.
</p>

<p>
    <enablement><not><systemTest property="osgi.os" value="macosx"/></not></enablement>
	<img src="../../images/tasks/export_02.png" width="504" height="457" alt="Export"/>
</p>
<p>
    <enablement><systemTest property="osgi.os" value="macosx"/></enablement>
	<img src="../../images/tasks/macosx/export_02.png" width="504" height="457" alt="Export"/>
</p>


<p>
Es ist jedoch auch auf einfache Weise m&#246;glich, sich Skalenb&#252;cher zu erzeugen.
In den Sichten <a href="../workbench/views/scales.html">Skalen</a>
und <a href="../workbench/views/scale_results.html">Skalen-Ergebnisse</a>
kannst du mit dem Kontextmen&#252;eintrag <em>Kopiere Skalenbl&#246;cke in die Zwischenablage</em>
die Bilddaten s&#228;mtlicher Skalenbl&#246;cke einer selektierten Skale in die Zwischenablage kopieren.
Welche Skalenbl&#246;cke einer Skalen dabei exportiert werden, h&#228;ngt von dem in den Benutzervorgaben gesetzten Skalenblockmodus ab
(<a href="../workbench/preferences/blocks.html">Datei &#8594; Benutzervorgaben... &#8594; Bl&#246;cke</a>).
</p>

<p>
Welche Bilddaten zu jedem einzelnen Akkord oder Skalenblock kopiert werden sollen
und in welcher Gr&#246;&#223;e die Bilddaten dabei exportiert bzw. kopiert werden sollen,
kannst du unter  (<a href="../workbench/preferences/export.html">Datei &#8594; Benutzervorgaben... &#8594; Export</a>)
noch genauer definieren.
</p>

<h2><a id="ExportActions_related_topics">Verwandte Themen</a></h2>
<p>
<a href="../workbench/views/chord_results.html">Arbeitsfl&#228;che &#8594; Sichten &#8594; Akkord-Ergebnisse</a><br/>
<a href="../workbench/views/scale_results.html">Arbeitsfl&#228;che &#8594; Sichten &#8594; Skalen-Ergebnisse</a><br/>
<a href="../workbench/views/fretboard.html">Arbeitsfl&#228;che &#8594; Sichten &#8594; Griffbrett</a><br/>
<a href="../workbench/views/keyboard.html">Arbeitsfl&#228;che &#8594; Sichten &#8594; Klaviatur</a><br/>
<a href="../workbench/views/box.html">Arbeitsfl&#228;che &#8594; Sichten &#8594; Box</a><br/>
<a href="../workbench/views/tab.html">Arbeitsfl&#228;che &#8594; Sichten &#8594; Tab</a><br/>
<a href="../workbench/views/notes.html">Arbeitsfl&#228;che &#8594; Sichten &#8594; Noten</a><br/>
<a href="../workbench/preferences/export.html">Arbeitsfl&#228;che &#8594; Benutzervorgaben &#8594; Export</a><br/>
<a href="../workbench/preferences/blocks.html">Arbeitsfl&#228;che &#8594; Benutzervorgaben &#8594; Bl&#246;cke</a><br/>
</p>

</body>
</html>
