<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" 
   "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="de" lang="de">

<head>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1" />
<title>Update-Funktionalit&#228;t</title>
<link type="text/css" rel="stylesheet" href="../book.css" />
</head>

<body>

<h1>Update-Funktionalit&#228;t</h1>

<p>		
Im letzten Kapitel dieser kleinen Rundtour soll nun noch abschlie&#223;end auf die Update-Funktionalit&#228;t 
des <em>Chord Scale Generators</em> eingegangen werden. Der <em>Chord Scale Generator</em> verf&#252;gt &#252;ber 
eine Update-Funktion, womit du dein Programm auf den neuesten Stand bringen kannst. Du musst also 
nicht das Programm jedes mal neu installieren, wenn eine neue Version verf&#252;gbar ist.
</p>

<p>		
Updates stellen kleine Verbesserungen des Programms dar. Dabei werden entweder mit einem Update neuen 
Funktionen bereitgestellt oder kleine Fehler behoben, die sich zuvor in das Programm eingeschlichen hatten. 
Es lohnt sich demnach regelm&#228;&#223;ig zu &#252;berpr&#252;fen, ob neue Updates verf&#252;gbar sind. Aber keine Angst, bei 
einem Update werden die aktuellen Einstellungen oder Daten (Instrumente, Akkorde oder Skalen) deiner 
Anwendung nat&#252;rlich nicht ver&#228;ndert.
</p>

<p>		
Die Suche nach neu zu installierenden Updates kannst du unter 
<a href="../workbench/menu/help.html#HelpMenu_Update">Hilfe &#8594; Suche nach Updates</a> starten. 
Damit &#252;berpr&#252;ft werden kann, ob eine neue Version des <em>Chord Scale Generator</em> verf&#252;gbar ist, muss 
f&#252;r den Update-Prozess eine aktive Internet-Verbindung vorliegen. Wird eine neue Version gefunden, 
erscheint ein entsprechender Dialog, welcher dir die neue Version anzeigt. Nachdem du nun noch 
den Lizenzangaben zugestimmt hast, wird die neue Version heruntergeladen und installiert. Abschlie&#223;end 
solltest du den <em>Chord Scale Generator</em> nun nur noch neu starten, damit die Ver&#228;nderungen wirksam 
werden k&#246;nnen.<br/>
Achtung: Das Herunterladen der neuen Version kann abh&#228;ngig von der Geschwindigkeit deiner 
Internet-Verbindung einige Zeit in Anspruch nehmen. Du kannst den Update-Prozess aber auch im 
Hintergrund laufen lassen, sodass du den <em>Chord Scale Generator</em> w&#228;hrenddessen benutzen kannst.
</p>

<p>		
Es ist auch m&#246;glich, die Suche nach Updates automatisch durchf&#252;hren zu lassen. Hierf&#252;r kannst du in 
den <a href="../workbench/preferences/update.html">Benutzervorgaben zum Update</a> genau einstellen, 
wann die Suche nach Updates automatisch ausgef&#252;hrt werden soll.
</p>

<p>
	<enablement><not><systemTest property="osgi.os" value="macosx"/></not></enablement>
	<img src="../../images/workbench/preferences/update.png" width="632" height="380" alt="Benutzervorgaben: Update"/>
</p>
<p>
	<enablement><systemTest property="osgi.os" value="macosx"/></enablement>
	<img src="../../images/workbench/preferences/macosx/update.png" width="628" height="399" alt="Benutzervorgaben: Update"/>
</p>

<h2><a id="ShowScales_related_topics">Verwandte Themen</a></h2>
<p>
<a href="../workbench/menu/help.html">Arbeitsfl&#228;che &#8594; Men&#252; &#8594; Hilfe</a><br/>
<a href="../workbench/preferences/update.html">Arbeitsfl&#228;che &#8594; Benutzervorgaben &#8594; Update</a><br/>
</p>

</body>
</html>
